[
  {
    "type": "Groundcovers",
    "name": "Myoporum parvifolium",
    "description": "Hardy prostrate groundcover that grows to one metre. Purple and white flowers during the summer months. An excellent spreading groundcover for a sunny well-drained position. Suitable in pots or containers.",
    "attracts": "Birds, lizards",
    "commonName": "Creeping boobialla "
  },
  {
    "type": "Groundcovers",
    "name": "Brachyscome multifida",
    "description": "Hardy eye-catching ground cover that grows to 15 centimetres with purple daisy flowers throughout the year. Best grown in full sun. Especially effective in rockeries, mass plantings, pots, hanging baskets and borders.",
    "attracts": "Bees, lizards",
    "commonName": "Cut leaf daisy "
  },
  {
    "type": "Groundcovers",
    "name": "Scaevola aemula",
    "description": "Spreading groundcover that grows to 60 centimetres with dark green foliage and small mauve-pink flowers in spring and summer. Prefers well-drained soils. Great for hanging baskets.",
    "attracts": "Bees, lizards",
    "commonName": "Fan flower "
  },
  {
    "type": "Groundcovers",
    "name": "Viola hederacea",
    "description": "Attractive dense groundcover that grows to 15 centimetres suitable for damp shady areas. Small, round, light green leaves with violet flowers throughout the year. Ideal for rockeries, mass plantings, pots and hanging baskets.",
    "attracts": "Lizards, frogs",
    "commonName": "Native violet "
  },
  {
    "type": "Tufting plants and grasses",
    "name": "Dianella caerulea",
    "description": "Hardy plant with long, strappy leaves that grows to 45 centimetres. Blue flowers on branched spikes appear in spring. Bright blue berries occur after flowering. Prefers a sunny position in well-drained soil.",
    "attracts": "Birds, lizards",
    "commonName": "Blue flax "
  },
  {
    "type": "Tufting plants and grasses",
    "name": "Crinum pedunculatum",
    "description": "Tufting plant with strappy leaves up to two metres. Open white flowers on thick stems from November to March. Prefers a damp spot in full sun or part shade.",
    "attracts": "Lizards, insects",
    "commonName": "Brisbane River lily "
  },
  {
    "type": "Tufting plants and grasses",
    "name": "Juncus usitatus",
    "description": "Very hardy vigorous, upright, clumping grass that grows to one metre. Grows well in moist soils. Pale brown flowers in spring. Great for stabilising banks and for decorative ponds. Grow in full sun.",
    "attracts": "Frogs, lizards",
    "commonName": "Common rush "
  },
  {
    "type": "Tufting plants and grasses",
    "name": "Fincinia nodosa",
    "description": "Tough, fast-growing, spreading, tufting grass with upright, dark green foliage up to one metre. Grows best in a full sun position. Brownish flower heads are produced on spikes throughout the year. Great plant for water features, ponds and effective in mass planting or containers.",
    "attracts": "Birds, frogs, lizards",
    "commonName": "Knobby club rush "
  },
  {
    "type": "Tufting plants and grasses",
    "name": "Lomandra sp.",
    "description": "Deep green, glossy, narrow strap leaves to one metre. Small yellow-cream flowers in spring and summer. Grow in a full sun to partial shade position.",
    "attracts": "Lizards, frogs",
    "commonName": "Mat rush ",
    "wikipedia": "https://en.wikipedia.org/wiki/Lomandra"
  },
  {
    "type": "Tufting plants and grasses",
    "name": "Carex appressa",
    "description": "Tall sedge growing to 80 centimetres. Attractive large, yellow seed heads in spring. Likes wet areas in full sun or partial shade. Ideal plant for around pool areas in pots or mass plantings.",
    "attracts": "Frogs, lizards",
    "commonName": "Sedge "
  },
  {
    "type": "Climbers",
    "name": "Pandorea jasminoides",
    "description": "A hardy, vigorous, evergreen twining plant over four metres with spectacular floral display. Flowers are pale pink with a deep pink throat and appear from spring through to late summer. Thrives in a full sun to partial shade position with good drainage. Best grown as a screen on a fence or trellis. Also great in large pots.",
    "attracts": "Butterflies, bees, insects",
    "commonName": "Bower vine "
  },
  {
    "type": "Climbers",
    "name": "Hibbertia scandens",
    "description": "A vigorous twiner with glossy, dark green leaves and large, golden yellow flowers over spring and summer. Grows to 1.5 metres and makes an excellent screening plant on walls or fences. Prefers well-drained soil. Grow in full sun to partial shade in an open position. Suitable for tubs and containers.",
    "attracts": "Birds",
    "commonName": "Guinea vine "
  },
  {
    "type": "Small shrubs",
    "name": "Callistemon sp.",
    "description": "Fast growing, hardy, woody shrub that grows up to two metres that produces beautiful blooms in a variety of single colours in spring and summer and sometimes again in autumn. Plant in a moist, well-drained, sunny position. Regularly prune to encourage bushier growth and increased flower production. Great for containers, edging, rockeries, hedges and borders.",
    "attracts": "Birds, insects",
    "commonName": "Bottlebrush "
  },
  {
    "type": "Small shrubs",
    "name": "Westringia sp.",
    "description": "Hardy, small, fast-growing, evergreen shrub that grows to 1m². Long flowering and suitable as a hedge or screening plant or for low maintenance gardens, exposed sites and coastal gardens. Suitable for container planting.",
    "attracts": "Birds, butterflies, insects",
    "commonName": "Coastal rosemary "
  },
  {
    "type": "Small shrubs",
    "name": "Grevillea sp.",
    "description": "Showy, evergreen plants that grow to two metres with nectar-rich flowers. They produce a 'spider flower' in a variety of single colours throughout the year. Grevillea's do best in a sunny position with light, gritty, free-draining soil.",
    "attracts": "Birds, bees, butterflies",
    "commonName": "Grevillea "
  },
  {
    "type": "Small shrubs",
    "name": "Banksia spinulosa",
    "description": "Hardy, evergreen shrub to two metres with bold flowing spikes in a variety of single colours. Flowers appear from autumn through to spring. Plant in an open, sunny position in well-drained soil. To encourage flower production and thicker foliage, cut flowering spikes and use in a floral display.",
    "attracts": "Birds",
    "commonName": "Hairpin banksia  - seasonal"
  },
  {
    "type": "Small shrubs",
    "name": "Melaleuca linariifolia",
    "description": "A dense and compact shrub that grows to 1.5 metres with attractive, claret-coloured new growth and white flowers in summer. A great foliage plant for shrubberies or in a pot. Grows well in full sun or semi-shaded positions.",
    "attracts": "Birds, insects",
    "commonName": "Honey myrtle 'Claret Tops' "
  },
  {
    "type": "Small shrubs",
    "name": "Melastoma affine",
    "description": "Hardy bushy shrub to two metres. Showy large pink/purple flower in summer. Prefers partial shade.",
    "attracts": "Birds, bees and insects",
    "commonName": "Native lasiandra "
  },
  {
    "type": "Small shrubs",
    "name": "Leptospermum sp.",
    "description": "Attractive small shrub ranging in size from 80 centimetres up to two metres. Showy pink or white flowers in spring and autumn. Prefers moist well-drained soil in full sun or light shade. A useful feature plant for rockeries or over retaining walls.",
    "attracts": "Insects, bees",
    "wikipedia": "https://en.wikipedia.org/wiki/Leptospermum",
    "commonName": "Tea tree "
  },
  {
    "type": "Small shrubs",
    "name": "Melaleuca thymifolia",
    "description": "Small hardy shrub to 1m². Mauve claw type flowers occur in clusters and are borne during summer. Grows best in full sun with good drainage. Suitable for large pots or containers.",
    "attracts": "Insects",
    "commonName": "Thyme honey myrtle "
  },
  {
    "type": "Medium shrubs",
    "name": "Banksia sp.",
    "description": "Hardy evergreen shrubs with attractive foliage with bold single colour flowering spikes. Plant in an open sunny position in well-drained soil.",
    "attracts": "Birds",
    "commonName": "Banksia  - seasonal"
  },
  {
    "type": "Medium shrubs",
    "name": "Callistemon sp.",
    "description": "Hardy, woody shrub that grows up to five metres that produces beautiful blooms in a variety of single colours in spring and summer and sometimes again in autumn. Plant in a moist, well-drained, sunny position. Regularly prune to encourage bushier growth and increased flower production. Bottlebrushes make excellent screening plants and are quick growers.",
    "attracts": "Birds, insects",
    "commonName": "Bottlebrush "
  },
  {
    "type": "Medium shrubs",
    "name": "Leptospermum sp.",
    "description": "A bushy rounded shrub that grows to five metres. White flowers cover the shrub in spring. Prefers well drained soil in a sunny position. Ideal as a screen, hedge or windbreak.",
    "attracts": "Insects, bees",
    "wikipedia": "https://en.wikipedia.org/wiki/Leptospermum",
    "commonName": "Tea tree "
  },
  {
    "type": "Medium shrubs",
    "name": "Syzgium sp.",
    "description": "Hardy evergreen plants to five metres with glossy, green leaves with fluffy, pom-pom, white flowers in spring and summer followed by red berries. Prefers a sunny position with well-drained soil. Lillypillies make excellent screens, windbreaks and hedges and can be pruned to size and shape.",
    "attracts": "Birds, bees, flying foxes",
    "commonName": "Lillypilly "
  },
  {
    "type": "Medium shrubs",
    "name": "Hovea acutifolia",
    "description": "A small to medium fast-growing shrub which is stunning in flower. Grows to four metres with masses of purple pea flowers from July to September. Best planted in a lightly shaded position in well-drained soil. Suitable as a windbreak, hedge or in a large pot or tub.",
    "attracts": "Birds, bees",
    "commonName": "Purple pea bush "
  },
  {
    "type": "Medium shrubs",
    "name": "Baekea virgata",
    "description": "Very hardy, bushy erect shrub that grows to 3.5 metres. Profuse small white flowers occur in clusters in spring and summer. Prefers a lightly shaded position in well-drained soil. Great for hedges or tubs.",
    "attracts": "Birds",
    "commonName": "Twiggy heath myrtle "
  },
  {
    "type": "Medium shrubs",
    "name": "Acacia fimbriata",
    "description": "A fast growing bushy small tree growing to 5 metres square. Dense yellow perfumed ball-shaped flowers appear in late winter and spring. Good hedge or screening plant and can be pruned to shape. Plant in full sun to a partial shade position. Hardy in most situations.",
    "attracts": "Birds, butterflies, bees",
    "commonName": "Brisbane wattle "
  },
  {
    "type": "Shade and feature trees",
    "name": "Archontophoenix cunninghamiana",
    "description": "Medium-tall, fast growing palm to 20+ metres. Lilac flowers followed by bright red fruits December to May. Suited to well composted soil with ample water and in a frost free area. This is a self-cleaning palm.",
    "attracts": "Birds",
    "commonName": "Bangalow/piccabeen palm "
  },
  {
    "type": "Shade and feature trees",
    "name": "Elaeocarpus reticulatus",
    "description": "Small, dense tree growing to eight metres. Masses of white or pink, small fringed, bell-shaped flowers are produced in summer. The flowers are followed by small blue fruits. Most soils are suitable and grow best in full sun to partial shade.",
    "attracts": "Birds",
    "commonName": "Blueberry ash "
  },
  {
    "type": "Shade and feature trees",
    "name": "Callistemon sp.",
    "description": "Fast growing, hardy tree with beautiful blooms in a variety of single colours in spring and summer. Plant in a moist, well-drained sunny position.",
    "attracts": "Bird, insects",
    "commonName": "Bottlebrush "
  },
  {
    "type": "Shade and feature trees",
    "name": "Xanthostemon chrysanthus",
    "description": "An attractive specimen tree up to eight metres. Showy, dense cluster of golden yellow flowers appear from summer to winter. Plant in full sun to part shade in well-drained soil. Suitable as a hedge, windbreak, screen, or feature tree.",
    "attracts": "Birds",
    "commonName": "Golden penda "
  },
  {
    "type": "Shade and feature trees",
    "name": "Grevillea sp.",
    "description": "Showy evergreen plants with nectar-rich 'spider flowers' in a variety of single colours. Plant in a sunny location with light, gritty, free-draining soil.",
    "attracts": "Birds, bees, butterflies",
    "commonName": "Grevillea "
  },
  {
    "type": "Shade and feature trees",
    "name": "Buckinghamia cellisima",
    "description": "Fast-growing evergreen tree that grows to eight metres. Striking, long, creamy-fragranced flowers from spring until autumn. Prefers moist, well-drained soil in full sun to semi shade.",
    "attracts": "Birds, bees",
    "commonName": "Ivory curl tree  -  seasonal"
  },
  {
    "type": "Shade and feature trees",
    "name": "Backhousia citriodora",
    "description": "Great small feature tree to five metres. White flowers from summer to autumn. Leaves are lemon scented. Prefers moist, well-drained soil in semi shade. Ideal for hedges or mixed shrub bed.",
    "attracts": "Birds, butterflies, bees",
    "commonName": "Lemon scented myrtle "
  },
  {
    "type": "Shade and feature trees",
    "name": "Syzgium sp.",
    "description": "Hardy, evergreen plants with glossy, green leaves with fluffy, pom-pom, white flowers in spring and summer followed by red berries. Prefers a sunny position with well-drained soil. Lillypillies make excellent screens, windbreaks and hedges and can be pruned to size and shape.",
    "attracts": "Birds, bees, flying foxes",
    "commonName": "Lillypilly "
  },
  {
    "type": "Shade and feature trees",
    "name": "Harpulia pendula",
    "description": "A hardy, fast-growing, evergreen tree that grows up to 10 metres with attractive, pale green foliage. Large sprays of greenish-yellow, slightly fragrant flowers appear in summer followed by orange fruit. Requires open sunny position in a light to medium soil type. Excellent shade tree.",
    "attracts": "Birds, bees",
    "commonName": "Tulipwood  - seasonal"
  },
  {
    "type": "Shade and feature trees",
    "name": "Waterhousia floribunda",
    "description": "Hardy, evergreen tree that grows to 8m². Clusters of white flowers appear from spring to summer, followed by green, round fruits. Plant in a sunny open position in well-drained soil. Regular trimming will produce colourful, new growth and keep the plant bushy. Can be trimmed to shape and size. Ideal as a dense screen or windbreak, or stunning as a large container plant.",
    "attracts": "Birds, bees",
    "commonName": "Weeping lillypilly "
  }
]
